modules/adwords_appengine/src/test/java/com/google/api/ads/adwords/jaxws/testing/test_request_oauth2.xml

<?xml version="1.0" ?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
  <S:Header>
    <RequestHeader xmlns="https://adwords.google.com/api/adwords/cm/#API_VERSION#">
        <clientCustomerId xmlns="https://adwords.google.com/api/adwords/cm/#API_VERSION#">TEST_CLIENT_CUSTOMER_ID</clientCustomerId>
        <developerToken xmlns="https://adwords.google.com/api/adwords/cm/#API_VERSION#">TEST_DEVELOPER_TOKEN</developerToken>
        <userAgent xmlns="https://adwords.google.com/api/adwords/cm/#API_VERSION#">TEST_APP (AwApi-Java, AdWords-AppEngine/3.12.0, Common-Java/3.12.0, JAX-WS/Unknown, Java/#JAVA_VERSION#, maven)</userAgent>
    </RequestHeader>
  </S:Header>
  <S:Body>
    <mutate xmlns="https://adwords.google.com/api/adwords/cm/#API_VERSION#" xmlns:ns2="https://adwords.google.com/api/adwords/video/#API_VERSION#">
      <operations>
        <operator>ADD</operator>
        <operand>
          <name>Test Budget Name</name>
          <amount>
            <microAmount>50000000</microAmount>
          </amount>
          <deliveryMethod>STANDARD</deliveryMethod>
        </operand>
      </operations>
    </mutate>
  </S:Body>
</S:Envelope>